In [2]:
#Q1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data.

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
def function1():
    ds = pd.Series([10,20,30,40,50,60])
    print(ds)

In [5]:
function1()

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [6]:
#Q2. Write a Pandas program to convert a Panda module Series to Python list and itâ€™s type.

In [7]:
def function2():
    ds = pd.Series([2, 4, 6, 8, 10])
    print("Pandas Series and type")
    print(ds)
    print(type(ds))
    print("Convert Pandas Series to Python list")
    print(ds.tolist())
    print(type(ds.tolist()))

In [8]:
function2()

Pandas Series and type
0     2
1     4
2     6
3     8
4    10
dtype: int64
<class 'pandas.core.series.Series'>
Convert Pandas Series to Python list
[2, 4, 6, 8, 10]
<class 'list'>

In [9]:
#Q 3. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.
 #  Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [10]:
def function3():
    n1 = pd.array([2, 4, 6, 8, 10])
    n2 = pd.array([1, 3, 5, 7, 9])
    print(f"N1 = {n1}")
    print(f"N2 = {n2}")
    print("-"*80)
    print(n1+n2)
    print("-"*80)
    print(n1-n2)
    print("-"*80)
    print(n1*n2)
    print("-"*80)
    print(n1/n2)

In [11]:
function3()

N1 = <IntegerArray>
[2, 4, 6, 8, 10]
Length: 5, dtype: Int64
N2 = <IntegerArray>
[1, 3, 5, 7, 9]
Length: 5, dtype: Int64
--------------------------------------------------------------------------------
<IntegerArray>
[3, 7, 11, 15, 19]
Length: 5, dtype: Int64
--------------------------------------------------------------------------------
<IntegerArray>
[1, 1, 1, 1, 1]
Length: 5, dtype: Int64
--------------------------------------------------------------------------------
<IntegerArray>
[2, 12, 30, 56, 90]
Length: 5, dtype: Int64
--------------------------------------------------------------------------------
<FloatingArray>
[2.0, 1.3333333333333333, 1.2, 1.1428571428571428, 1.1111111111111112]
Length: 5, dtype: Float64

In [12]:
#Q4. Write a Pandas program to convert a dictionary to a Pandas series.

In [13]:
def function4():
    r1 = {'a':15, 'b':25, 'c':35, 'd':45}
    print("origenal dictionary")
    print(r1)
    New_Series = pd.Series(r1)
    print("converted series")
    print(New_Series)

In [14]:
function4()

origenal dictionary
{'a': 15, 'b': 25, 'c': 35, 'd': 45}
converted series
a    15
b    25
c    35
d    45
dtype: int64

In [15]:
#Q5. Write a Pandas program to convert a NumPy array to a Pandas series.

In [16]:
def function5():
    n3 = np.array([11,22,33,44,55,66])
    print("Numpy array")
    print(n3)
    New_Series = pd.Series(n3)
    print("Pandas array")
    print(New_Series)

In [17]:
function5()

Numpy array
[11 22 33 44 55 66]
Pandas array
0    11
1    22
2    33
3    44
4    55
5    66
dtype: int64

In [18]:
#Q6. Write a Pandas program to change the data type of given a column or a Series.

In [19]:
def function6():
    s1 = pd.Series(['10', '20', 'sunbeam', '70.80', '500'])
    print("origenal series")
    print(s1)
    print("Change the said data type to numeric:")
    s2 = pd.to_numeric(s1, errors='coerce')

In [20]:
function6()

origenal series
0         10
1         20
2    sunbeam
3      70.80
4        500
dtype: object
Change the said data type to numeric:

In [21]:
#Q7. Write a Pandas program to convert a given Series to an array.

In [22]:
def function7():
    s3 = ([10, 20, 30, 40, 50,])
    print("Origenal data series")
    print(s3)
    print("Series to array")
    a = np.array(s3)
    print(a)
    print(type(a))

In [23]:
function7()

Origenal data series
[10, 20, 30, 40, 50]
Series to array
[10 20 30 40 50]
<class 'numpy.ndarray'>

In [24]:
#Q8. Write a Pandas program to create a dataframe from a dictionary and display it.

In [25]:
def function8():
    df = pd.read_csv('./50_Startups.csv')

In [26]:
function8()

In [27]:
df = pd.read_csv('./50_Startups.csv')

In [28]:
print(df)

          RnD  Administration  Marketing       State     Profit
0   165349.20       136897.80  471784.10    New York  192261.83
1   162597.70       151377.59  443898.53  California  191792.06
2   153441.51       101145.55  407934.54     Florida  191050.39
3   144372.41       118671.85  383199.62    New York  182901.99
4   142107.34        91391.77  366168.42     Florida  166187.94
5   131876.90        99814.71  362861.36    New York  156991.12
6   134615.46       147198.87  127716.82  California  156122.51
7   130298.13       145530.06  323876.68     Florida  155752.60
8   120542.52       148718.95  311613.29    New York  152211.77
9   123334.88       108679.17  304981.62  California  149759.96
10  101913.08       110594.11  229160.95     Florida  146121.95
11  100671.96        91790.61  249744.55  California  144259.40
12   93863.75       127320.38  249839.44     Florida  141585.52
13   91992.39       135495.07  252664.93  California  134307.35
14  119943.24       156547.42  256512.92     Florida  132602.65
15  114523.61       122616.84  261776.23    New York  129917.04
16   78013.11       121597.55  264346.06  California  126992.93
17   94657.16       145077.58  282574.31    New York  125370.37
18   91749.16       114175.79  294919.57     Florida  124266.90
19   86419.70       153514.11       0.00    New York  122776.86
20   76253.86       113867.30  298664.47  California  118474.03
21   78389.47       153773.43  299737.29    New York  111313.02
22   73994.56       122782.75  303319.26     Florida  110352.25
23   67532.53       105751.03  304768.73     Florida  108733.99
24   77044.01        99281.34  140574.81    New York  108552.04
25   64664.71       139553.16  137962.62  California  107404.34
26   75328.87       144135.98  134050.07     Florida  105733.54
27   72107.60       127864.55  353183.81    New York  105008.31
28   66051.52       182645.56  118148.20     Florida  103282.38
29   65605.48       153032.06  107138.38    New York  101004.64
30   61994.48       115641.28   91131.24     Florida   99937.59
31   61136.38       152701.92   88218.23    New York   97483.56
32   63408.86       129219.61   46085.25  California   97427.84
33   55493.95       103057.49  214634.81     Florida   96778.92
34   46426.07       157693.92  210797.67  California   96712.80
35   46014.02        85047.44  205517.64    New York   96479.51
36   28663.76       127056.21  201126.82     Florida   90708.19
37   44069.95        51283.14  197029.42  California   89949.14
38   20229.59        65947.93  185265.10    New York   81229.06
39   38558.51        82982.09  174999.30  California   81005.76
40   28754.33       118546.05  172795.67  California   78239.91
41   27892.92        84710.77  164470.71     Florida   77798.83
42   23640.93        96189.63  148001.11  California   71498.49
43   15505.73       127382.30   35534.17    New York   69758.98
44   22177.74       154806.14   28334.72  California   65200.33
45    1000.23       124153.04    1903.93    New York   64926.08
46    1315.46       115816.21  297114.46     Florida   49490.75
47       0.00       135426.92       0.00  California   42559.73
48     542.05        51743.15       0.00    New York   35673.41
49       0.00       116983.80   45173.06  California   14681.40

In [29]:
#Q10. i) Read the MyRecord.csv file.
 #   ii) Create a new column Salary.

In [30]:
df = pd.read_csv('./Salary_Data.csv')

In [31]:
print(df)

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [32]:
#Q10 ii) Create a new column Salary.

In [33]:
df['bonus'] = df['Salary'] * 0.15

In [34]:
print(df)

    YearsExperience  Salary     bonus
0               1.1   39343   5901.45
1               1.3   46205   6930.75
2               1.5   37731   5659.65
3               2.0   43525   6528.75
4               2.2   39891   5983.65
5               2.9   56642   8496.30
6               3.0   60150   9022.50
7               3.2   54445   8166.75
8               3.2   64445   9666.75
9               3.7   57189   8578.35
10              3.9   63218   9482.70
11              4.0   55794   8369.10
12              4.0   56957   8543.55
13              4.1   57081   8562.15
14              4.5   61111   9166.65
15              4.9   67938  10190.70
16              5.1   66029   9904.35
17              5.3   83088  12463.20
18              5.9   81363  12204.45
19              6.0   93940  14091.00
20              6.8   91738  13760.70
21              7.1   98273  14740.95
22              7.9  101302  15195.30
23              8.2  113812  17071.80
24              8.7  109431  16414.65
25              9.0  105582  15837.30
26              9.5  116969  17545.35
27              9.6  112635  16895.25
28             10.3  122391  18358.65
29             10.5  121872  18280.80
30             11.0  140000  21000.00
31             12.0  155000  23250.00
32             13.0  156000  23400.00

In [35]:
#Q11. Refer the dataset "Advertising.csv" and perform following tasks.
#i) Read the dataset "Advertising.csv" in data frame.

In [36]:
df = pd.read_csv('./50_Startups.csv')

In [37]:
print(df)

          RnD  Administration  Marketing       State     Profit
0   165349.20       136897.80  471784.10    New York  192261.83
1   162597.70       151377.59  443898.53  California  191792.06
2   153441.51       101145.55  407934.54     Florida  191050.39
3   144372.41       118671.85  383199.62    New York  182901.99
4   142107.34        91391.77  366168.42     Florida  166187.94
5   131876.90        99814.71  362861.36    New York  156991.12
6   134615.46       147198.87  127716.82  California  156122.51
7   130298.13       145530.06  323876.68     Florida  155752.60
8   120542.52       148718.95  311613.29    New York  152211.77
9   123334.88       108679.17  304981.62  California  149759.96
10  101913.08       110594.11  229160.95     Florida  146121.95
11  100671.96        91790.61  249744.55  California  144259.40
12   93863.75       127320.38  249839.44     Florida  141585.52
13   91992.39       135495.07  252664.93  California  134307.35
14  119943.24       156547.42  256512.92     Florida  132602.65
15  114523.61       122616.84  261776.23    New York  129917.04
16   78013.11       121597.55  264346.06  California  126992.93
17   94657.16       145077.58  282574.31    New York  125370.37
18   91749.16       114175.79  294919.57     Florida  124266.90
19   86419.70       153514.11       0.00    New York  122776.86
20   76253.86       113867.30  298664.47  California  118474.03
21   78389.47       153773.43  299737.29    New York  111313.02
22   73994.56       122782.75  303319.26     Florida  110352.25
23   67532.53       105751.03  304768.73     Florida  108733.99
24   77044.01        99281.34  140574.81    New York  108552.04
25   64664.71       139553.16  137962.62  California  107404.34
26   75328.87       144135.98  134050.07     Florida  105733.54
27   72107.60       127864.55  353183.81    New York  105008.31
28   66051.52       182645.56  118148.20     Florida  103282.38
29   65605.48       153032.06  107138.38    New York  101004.64
30   61994.48       115641.28   91131.24     Florida   99937.59
31   61136.38       152701.92   88218.23    New York   97483.56
32   63408.86       129219.61   46085.25  California   97427.84
33   55493.95       103057.49  214634.81     Florida   96778.92
34   46426.07       157693.92  210797.67  California   96712.80
35   46014.02        85047.44  205517.64    New York   96479.51
36   28663.76       127056.21  201126.82     Florida   90708.19
37   44069.95        51283.14  197029.42  California   89949.14
38   20229.59        65947.93  185265.10    New York   81229.06
39   38558.51        82982.09  174999.30  California   81005.76
40   28754.33       118546.05  172795.67  California   78239.91
41   27892.92        84710.77  164470.71     Florida   77798.83
42   23640.93        96189.63  148001.11  California   71498.49
43   15505.73       127382.30   35534.17    New York   69758.98
44   22177.74       154806.14   28334.72  California   65200.33
45    1000.23       124153.04    1903.93    New York   64926.08
46    1315.46       115816.21  297114.46     Florida   49490.75
47       0.00       135426.92       0.00  California   42559.73
48     542.05        51743.15       0.00    New York   35673.41
49       0.00       116983.80   45173.06  California   14681.40

In [38]:
#Q11 ii) Print first five records of dataset.

In [39]:
df.head()

         RnD  Administration  Marketing       State     Profit
0  165349.20       136897.80  471784.10    New York  192261.83
1  162597.70       151377.59  443898.53  California  191792.06
2  153441.51       101145.55  407934.54     Florida  191050.39
3  144372.41       118671.85  383199.62    New York  182901.99
4  142107.34        91391.77  366168.42     Florida  166187.94

In [40]:
#Q11. iii) print last five records from dataset.

In [41]:
df.tail()

        RnD  Administration  Marketing       State    Profit
45  1000.23       124153.04    1903.93    New York  64926.08
46  1315.46       115816.21  297114.46     Florida  49490.75
47     0.00       135426.92       0.00  California  42559.73
48   542.05        51743.15       0.00    New York  35673.41
49     0.00       116983.80   45173.06  California  14681.40

In [42]:
#Q11. iv) display the columns inside the dataset

In [43]:
df.columns

Index(['RnD', 'Administration', 'Marketing', 'State', 'Profit'], dtype='object')

In [44]:
#Q11. v) display last three records from dataset.

In [45]:
df.tail(3)

       RnD  Administration  Marketing       State    Profit
47    0.00       135426.92       0.00  California  42559.73
48  542.05        51743.15       0.00    New York  35673.41
49    0.00       116983.80   45173.06  California  14681.40

In [46]:
#Q11. vi) display the information about the dataset and analyse the data.

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   RnD             50 non-null     float64
 1   Administration  50 non-null     float64
 2   Marketing       50 non-null     float64
 3   State           50 non-null     object
 4   Profit          50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

In [48]:
#Q11. vii) display types of each columns.

In [49]:
#Q11.viii) check for null values in the dataset and display the sum of null values inside the column.

In [50]:
df.isna().sum()

RnD               0
Administration    0
Marketing         0
State             0
Profit            0
dtype: int64

In [51]:
#Q11.ix) drop a column 'radio' from a dataset and display first ten records.

In [52]:
df.drop(['Marketing'],axis = 1)

          RnD  Administration       State     Profit
0   165349.20       136897.80    New York  192261.83
1   162597.70       151377.59  California  191792.06
2   153441.51       101145.55     Florida  191050.39
3   144372.41       118671.85    New York  182901.99
4   142107.34        91391.77     Florida  166187.94
5   131876.90        99814.71    New York  156991.12
6   134615.46       147198.87  California  156122.51
7   130298.13       145530.06     Florida  155752.60
8   120542.52       148718.95    New York  152211.77
9   123334.88       108679.17  California  149759.96
10  101913.08       110594.11     Florida  146121.95
11  100671.96        91790.61  California  144259.40
12   93863.75       127320.38     Florida  141585.52
13   91992.39       135495.07  California  134307.35
14  119943.24       156547.42     Florida  132602.65
15  114523.61       122616.84    New York  129917.04
16   78013.11       121597.55  California  126992.93
17   94657.16       145077.58    New York  125370.37
18   91749.16       114175.79     Florida  124266.90
19   86419.70       153514.11    New York  122776.86
20   76253.86       113867.30  California  118474.03
21   78389.47       153773.43    New York  111313.02
22   73994.56       122782.75     Florida  110352.25
23   67532.53       105751.03     Florida  108733.99
24   77044.01        99281.34    New York  108552.04
25   64664.71       139553.16  California  107404.34
26   75328.87       144135.98     Florida  105733.54
27   72107.60       127864.55    New York  105008.31
28   66051.52       182645.56     Florida  103282.38
29   65605.48       153032.06    New York  101004.64
30   61994.48       115641.28     Florida   99937.59
31   61136.38       152701.92    New York   97483.56
32   63408.86       129219.61  California   97427.84
33   55493.95       103057.49     Florida   96778.92
34   46426.07       157693.92  California   96712.80
35   46014.02        85047.44    New York   96479.51
36   28663.76       127056.21     Florida   90708.19
37   44069.95        51283.14  California   89949.14
38   20229.59        65947.93    New York   81229.06
39   38558.51        82982.09  California   81005.76
40   28754.33       118546.05  California   78239.91
41   27892.92        84710.77     Florida   77798.83
42   23640.93        96189.63  California   71498.49
43   15505.73       127382.30    New York   69758.98
44   22177.74       154806.14  California   65200.33
45    1000.23       124153.04    New York   64926.08
46    1315.46       115816.21     Florida   49490.75
47       0.00       135426.92  California   42559.73
48     542.05        51743.15    New York   35673.41
49       0.00       116983.80  California   14681.40

In [53]:
#Q11. x) increase the sales by 10% and add a new column "updated_sales" in dataframe.

In [54]:
df['bonus'] = df['Profit'] * 0.10

In [55]:
print(df)

          RnD  Administration  Marketing       State     Profit      bonus
0   165349.20       136897.80  471784.10    New York  192261.83  19226.183
1   162597.70       151377.59  443898.53  California  191792.06  19179.206
2   153441.51       101145.55  407934.54     Florida  191050.39  19105.039
3   144372.41       118671.85  383199.62    New York  182901.99  18290.199
4   142107.34        91391.77  366168.42     Florida  166187.94  16618.794
5   131876.90        99814.71  362861.36    New York  156991.12  15699.112
6   134615.46       147198.87  127716.82  California  156122.51  15612.251
7   130298.13       145530.06  323876.68     Florida  155752.60  15575.260
8   120542.52       148718.95  311613.29    New York  152211.77  15221.177
9   123334.88       108679.17  304981.62  California  149759.96  14975.996
10  101913.08       110594.11  229160.95     Florida  146121.95  14612.195
11  100671.96        91790.61  249744.55  California  144259.40  14425.940
12   93863.75       127320.38  249839.44     Florida  141585.52  14158.552
13   91992.39       135495.07  252664.93  California  134307.35  13430.735
14  119943.24       156547.42  256512.92     Florida  132602.65  13260.265
15  114523.61       122616.84  261776.23    New York  129917.04  12991.704
16   78013.11       121597.55  264346.06  California  126992.93  12699.293
17   94657.16       145077.58  282574.31    New York  125370.37  12537.037
18   91749.16       114175.79  294919.57     Florida  124266.90  12426.690
19   86419.70       153514.11       0.00    New York  122776.86  12277.686
20   76253.86       113867.30  298664.47  California  118474.03  11847.403
21   78389.47       153773.43  299737.29    New York  111313.02  11131.302
22   73994.56       122782.75  303319.26     Florida  110352.25  11035.225
23   67532.53       105751.03  304768.73     Florida  108733.99  10873.399
24   77044.01        99281.34  140574.81    New York  108552.04  10855.204
25   64664.71       139553.16  137962.62  California  107404.34  10740.434
26   75328.87       144135.98  134050.07     Florida  105733.54  10573.354
27   72107.60       127864.55  353183.81    New York  105008.31  10500.831
28   66051.52       182645.56  118148.20     Florida  103282.38  10328.238
29   65605.48       153032.06  107138.38    New York  101004.64  10100.464
30   61994.48       115641.28   91131.24     Florida   99937.59   9993.759
31   61136.38       152701.92   88218.23    New York   97483.56   9748.356
32   63408.86       129219.61   46085.25  California   97427.84   9742.784
33   55493.95       103057.49  214634.81     Florida   96778.92   9677.892
34   46426.07       157693.92  210797.67  California   96712.80   9671.280
35   46014.02        85047.44  205517.64    New York   96479.51   9647.951
36   28663.76       127056.21  201126.82     Florida   90708.19   9070.819
37   44069.95        51283.14  197029.42  California   89949.14   8994.914
38   20229.59        65947.93  185265.10    New York   81229.06   8122.906
39   38558.51        82982.09  174999.30  California   81005.76   8100.576
40   28754.33       118546.05  172795.67  California   78239.91   7823.991
41   27892.92        84710.77  164470.71     Florida   77798.83   7779.883
42   23640.93        96189.63  148001.11  California   71498.49   7149.849
43   15505.73       127382.30   35534.17    New York   69758.98   6975.898
44   22177.74       154806.14   28334.72  California   65200.33   6520.033
45    1000.23       124153.04    1903.93    New York   64926.08   6492.608
46    1315.46       115816.21  297114.46     Florida   49490.75   4949.075
47       0.00       135426.92       0.00  California   42559.73   4255.973
48     542.05        51743.15       0.00    New York   35673.41   3567.341
49       0.00       116983.80   45173.06  California   14681.40   1468.140

In [56]:
 #Q11.xi)display shape of data.

In [57]:
shape = df.shape

In [58]:
print(shape)

(50, 6)

In [59]:
#Q11. xiii) describe the dataset.

In [60]:
df.describe()

,RnD,Administration,Marketing,Profit,bonus
count,50.000000,50.000000,50.000000,50.000000,50.000000
mean,73721.615600,121344.639600,211025.097800,112012.639200,11201.263920
std,45902.256482,28017.802755,122290.310726,40306.180338,4030.618034
min,0.000000,51283.140000,0.000000,14681.400000,1468.140000
25%,39936.370000,103730.875000,129300.132500,90138.902500,9013.890250
50%,73051.080000,122699.795000,212716.240000,107978.190000,10797.819000
75%,101602.800000,144842.180000,299469.085000,139765.977500,13976.597750
max,165349.200000,182645.560000,471784.100000,192261.830000,19226.183000

In [61]:
#Q11.xii) Find out maximum,minimum,mean,median,standard deviation value of each column.

In [62]:
print(df.min())

RnD                      0.0
Administration      51283.14
Marketing                0.0
State             California
Profit               14681.4
bonus                1468.14
dtype: object

In [63]:
print(df.max())

RnD                165349.2
Administration    182645.56
Marketing          471784.1
State              New York
Profit            192261.83
bonus             19226.183
dtype: object

In [64]:
#Q12. Refer the dataset "Salaries.csv" and perform following tasks.
#i) Read the dataset in dataframe.

In [65]:
df = pd.read_csv('./Salary_Data.csv')

In [66]:
print(df)

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [67]:
#Q12 ii) display first five records.

In [68]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [69]:
#Q12 ii) display first five records.

In [70]:
df.head(10)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
5              2.9   56642
6              3.0   60150
7              3.2   54445
8              3.2   64445
9              3.7   57189

In [71]:
#Q12 iv) display last five records.

In [72]:
df.tail()

    YearsExperience  Salary
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [73]:
#Q12 v) display last ten records.

In [74]:
df.tail(10)

    YearsExperience  Salary
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [75]:
#Q12 vi) display the columns inside the dataset.

In [77]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [78]:
#Q12 vii) display shape of data.

In [79]:
df.shape

(33, 2)

In [80]:
#Q12viii) describe the dataset.

In [81]:
df.describe()

       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000

In [82]:
#Q12 ix) display the information about the dataset and analyse the data.

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  33 non-null     float64
 1   Salary           33 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 656.0 bytes